// Go підтримує створення констант зі значеннями типу
// рядок (string), число (int або float), а також
// логічного типу (bool).
package main

import "fmt"
import "math"

// Декларація константи проходить за допомогою ключового
// слова `const`.
const s string = "constant"

func main() {
    fmt.Println(s)

    // Ключове слово `const` може з’являтись будь де,
    // де може з’являтись ключове слово `var` (яким декларуються _[змінні](./variables)_).
    const n = 500000000

    // Вирази констант обчислюються за допомогою
    // [арфиметики з довільною точністю](https://uk.wikipedia.org/wiki/%D0%94%D0%BE%D0%B2%D0%B3%D0%B0_%D0%B0%D1%80%D0%B8%D1%84%D0%BC%D0%B5%D1%82%D0%B8%D0%BA%D0%B0).
    const d = 3e20 / n
    fmt.Println(d)

    // Числові константи можуть не мати типу допоки
    // їм не присвоять його, як у нашому прикладі з
    // явним перетворення.
    fmt.Println(int64(d))

    // Числовій константі може бути надано тип шляхом використання
    // її у контексті що потребує тип, наприклад у присвоєнні або
    // виклицу функції. Нижче подано примірник де `math.Sin` очікує
    // значення типу `float64`.
    fmt.Println(math.Sin(n))
}
