// Ключове слово _range_ (діапазон) ітерує по елементах в деяких
// структурах данних доступних в Go. Давайте подивимось, як
// використовувати `range` з вже знайомими нам структурами данних.

package main

import "fmt"

func main() {

    // Ось - приклад сумування чисел у [зрізі](./slices).
    // З масивами це працює аналогічним чином.
    nums := []int{2, 3, 4}
    sum := 0
    for _, num := range nums {
        sum += num
    }
    fmt.Println("sum:", sum)

    // `range` на масивах та зрізах видає і індекс
    // і значення для кожного з входжень. У праклиді вище
    // нам не потрібен був індекс, отож ми ігнорували його
    // за допомогою пустого ідентфиікатора `_`. Але,
    // інколи, індекс буває потрібен.
    for i, num := range nums {
        if num == 3 {
            fmt.Println("index:", i)
        }
    }

    // `range` застосований на мапу поверне ключ та значення
    // пари.
    kvs := map[string]string{"a": "абрикос", "b": "банан"}
    for k, v := range kvs {
        fmt.Printf("%s -> %s\n", k, v)
    }

    // `range` також може просто ітерувати влючі на мапі.
    for k := range kvs {
        fmt.Println("key:", k)
    }

    // `range` на рядку ітеруватиме через Unicode'ні коди.
    // Першим значенням буде початковий байт індекс руни (`rune`),
    // а другим сама руна (`rune` - це тип значення в Go).
    for i, c := range "го" {
        fmt.Println(i, c)
    }
}
