// [_Варіативна функція_](http://en.wikipedia.org/wiki/Variadic_function)
// може бути викликана з будьякою кількістю елементів.
// Так от `fmt.Println` є прикладом варіативної функції.

package main

import "fmt"

// Ось функція, що прийме довільну кількість цілих чисел,
// як свої аргументи.
func sum(nums ...int) {
    fmt.Print(nums, " ")
    total := 0
    for _, num := range nums {
        total += num
    }
    fmt.Println(total)
}

func main() {

    // Варіативні функції можуть бути викликані в
    // звичайні манері з окремо вказаними аргументами.
    sum(1, 2)
    sum(1, 2, 3)

    // Але якщо у вас вже є кілька аргументів у вигляді [`зріза`](./slices),
    // ви можете застосувати їх до варіативної функції
    // використовуючи розпаковку `func(slice...)` наступним чином.
    nums := []int{1, 2, 3, 4}
    sum(nums...)
}
