# Щоб запустити програми, збережіть її код до файлу
# `hello-world.go` та використайте команду `go run`.
$ go run hello-world.go
Привіт Світе

# Інколи, ми можемо захотіти скомпілювати нашу програму
# у вигляді двійкового файлу. Нам допоможе команда `go build`.
$ go build hello-world.go
$ ls
hello-world	hello-world.go

# Тепер запустіть скомпільований файл "напряму".
$ ./hello-world
Привіт Світе

# Після того, як ми опанували запуск та компіляцію
# базових Go програми, дізнаємось більше про саму мову.
