// Go підтримує _повернення кількох значень_. Ця особилвість
// часто використовується в ідіоматичному Go, наприклад,
// для повернення результату виконання та помилки функції.
package main

import "fmt"

// Конструкція `(int, int)` в цій декларації цієї функції
// показує, що вона зобов’‎язується повернути два цілих числа (`int`).
func vals() (int, int) {
    return 3, 7
}

func main() {

    // В цьому прикладі ми декларуємо дві різні змінні шляхом
    // присвоєння виклику функції що повертає два значення.
    a, b := vals()
    fmt.Println(a)
    fmt.Println(b)

    // Якщо ви плануєте викристати лише частину повернених
    // значень - використауйте пустий ідентифікатор `_`.
    _, c := vals()
    fmt.Println(c)
}
