// В [попередньому](range) прикладі ми бачили як `for` та
// `range` забезпечують ітерацію для базових структур данних.
// Цей синтаксис також може бути використаний для
// отримання значень з каналу.

package main

import "fmt"

func main() {

    // Ми будемо ітурувати 2 значення що ми зараз кладемо
    // до каналу `queue`.
    queue := make(chan string, 2)
    queue <- "раз"
    queue <- "два"
    close(queue)

    // Цей `range` ітерує через кожен елемент що він отримує
    // з `queue`. і тому що микрили цей канал вище ітерація
    // припиняється, після отримання 2 елементів.
    for elem := range queue {
        fmt.Println(elem)
    }
}
