# Запуск цієї програми покаже хеш та виведе його у
# форматі зрозумілому для людини.
$ go run sha1-hashes.go
це рядок sha1
afa57c30c2333a0a4bccd5d7292efc211f07e510
використай sha1.Sum([]byte)
5f0d608c5a8be56c733b6113d6161198f687436c

# Ви можете обчислювати і інші типи хешу використовуючи схожий
# до вищенаведеного сценарій. Наприклад, порахувати
# MD5 хеші - можливо після імпорту `crypto/md5` і
# використання `md5.New()` (або `md5.Sum([]byte)` -
# що значно зручніше).

# Зауважте - якщо вам потрібні криптографічно-безпечні
# хеші - спершу порівняйте переваги і недоліки [різноматнітних
# алгоритмів хешування](https://uk.wikipedia.org/wiki/Криптографічна_хеш-функція)!
