# Наша програма покаже 5 завдань - що виконуються
# різними працівниками. Програма працює близько
# 2 секунд, не зважаючи на роботу розраховану
# вцілому на 5 секунд - і все це завдяки 3'ом
# працівникам, що працюються одночасно.
$ time go run worker-pools.go
працівник 1 почав проботу над завданням 2
працівник 3 почав проботу над завданням 1
працівник 2 почав проботу над завданням 3
працівник 1 закінчив роботу над завданням 2
працівник 3 закінчив роботу над завданням 1
працівник 3 почав проботу над завданням 5
працівник 2 закінчив роботу над завданням 3
працівник 1 почав проботу над завданням 4
працівник 1 закінчив роботу над завданням 4
працівник 3 закінчив роботу над завданням 5

real	0m2.322s
user	0m0.231s
sys	0m0.290s
