# Наша программа показує 5 завдань що виконуються
# різними працівниками. Программа працює лише близько
# 2 секунд, не зважаючи на роботу розраховану
# вцілому на 5 секунд і все це завдяки 3
# працівникам що працюються одночасно.
$ time go run worker-pools.go
працівник 3 почав працювати над завданням 1
працівник 1 почав працювати над завданням 2
працівник 2 почав працювати над завданням 3
працівник 2 закінчив працювати над завданням 3
працівник 2 почав працювати над завданням 4
працівник 3 закінчив працювати над завданням 1
працівник 3 почав працювати над завданням 5
працівник 1 закінчив працювати над завданням 2
працівник 2 закінчив працювати над завданням 4
працівник 3 закінчив працювати над завданням 5

real	0m2.322s
user	0m0.231s
sys	0m0.290s
