// [_Аргументи командного рядка_](https://uk.wikipedia.org/wiki/Інтерфейс_командного_рядка#Формат_команди) це загальноприйнятий спосіб
// запуску програм з командний інтерфейсом. Наприклад,
// `go run hello.go` використовує `run` і  `hello.go`
// як аргументи для програми `go`.

package main

import "os"
import "fmt"

func main() {

    // `os.Args` надає доступ для незмінених аргументів
    // командного рядка. Зауважте що першим значенням у
    // цьому зрізі буде шлях до самої програми, а `os.Args[1:]`
    // буде утримувати вже аргументи до програми
    argsWithProg := os.Args
    argsWithoutProg := os.Args[1:]

    // Ви можете отримати значення індивідуальних аргументів
    // використовуючи звичайний синтаксис доступа по індексу.
    arg := os.Args[1]

    fmt.Println(argsWithProg)
    fmt.Println(argsWithoutProg)
    fmt.Println(arg)
}
