// Використовуйте `os.Exit` для негайного виходу з
// [відповідним статусом](https://en.wikipedia.org/wiki/Exit_status).

package main

import "fmt"
import "os"

func main() {

    // Відкладений виклик ( за допомогою `defer`) ніколи не буде запущено якщо буде викоирстана `os.Exit`, отож `fmt.Println` просто не виконається.
    defer fmt.Println("!")

    // Вийти зі статусом 3.
    os.Exit(3)
}

// Напротивагу С/С++, Go не потребує використовувати
// ціле число, як значення що повертається з функції main
// (що вказати операційній системі з яким статусом
// завершилась программа). Тобто, якщо ви захочете
// вийти з ненульовим статусом - ви змушені будете
// скористатись `os.Exit`.
