// Go'шний _select_ (вибір) довзовляє вам очікувати на операція з кількома каналами. Комбінування горутин та каналів з _select_ це дуже потужна особливість Go.

package main

import "time"
import "fmt"

func main() {

    // Наприклад ми хочемо обирати поміж двох каналів.
    c1 := make(chan string)
    c2 := make(chan string)

    // Кожен канал отримає значення після якогось проміжку часу,
    // симулючи, скажімо, блокуючі виклики від сторонніх сервісів
    // що виконуються одночасних г орутинах.
    go func() {
        time.Sleep(1 * time.Second)
        c1 <- "один"
    }()
    go func() {
        time.Sleep(2 * time.Second)
        c2 <- "два"
    }()

    // Ми використаємо `select` для очікування обох значень
    // одночасно, друкуючи повідомлення на екран щойно ми
    // їх отримаємо.
    for i := 0; i < 2; i++ {
        select {
        case msg1 := <-c1:
            fmt.Println("отримано", msg1)
        case msg2 := <-c2:
            fmt.Println("отримано", msg2)
        }
    }
}
