// Розгалуження з `if` та `else` в Go дуже прості.

package main

import "fmt"

func main() {

	// Ось базовий приклад.
	if 7%2 == 0 {
		fmt.Println("7 парне")
	} else {
		fmt.Println("7 не парне")
	}

	// Дозволяється мати твердження `if` без `else`
	if 8%4 == 0 {
		fmt.Println("8 ділиться на 4")
	}

	// Твердження може передувати умовам, будь яка змінна декларована
	// в такому твердженні доступна в усіх розгалуженнях.
	if num := 9; num < 0 {
		fmt.Println(num, "є негативним числом")
	} else if num < 10 {
		fmt.Println(num, "має одну цифру")
	} else {
		fmt.Println(num, "має багато цифр")
	}
}

// Увага, вам не потрібні круглі дужки навколо умов в Go,
// вимагається лише фігурні дужки.
