// _Канали_ це протоки, що об’єднуть горутини,
// які виконуються водночас. Ми можете надсилати
// данні до каналу з однієї горутини та
// отримаувати у іншій.

package main

import "fmt"

func main() {

    // Канали створюються наступним синтаксисом `make(chan тип-каналу)`.
    // Канали типізовані типом змінної що вони передають.
    messages := make(chan string)

    // _Надіслати_ значення до каналу можна використовуючи
    // `channel <-` синтаксис. Ось тут ми надішлемо `"ping"`
    // до каналу `messages` що ми створити з горутини
    // анонімної функції.
    go func() { messages <- "ping" }()

    // Синтаксис `<-channel` _отримує_ значення з каналу.
    // Ось тут ми отримуємо повідомлення `"ping"`, що ми
    // щойно відправили і друкуємо його до екрану.
    msg := <-messages
    fmt.Println(msg)
}
