// `panic` зазвичай означає те, що щось пішло неочікувано
// погано. Дуже погано. В більшості випадків, ми
// використовуємо її задля швидкого провалу
// на помилках які зазвичай не мали б виникнути, або
// на помилках які ми не здадтні опрацювати акуратно.

package main

import "os"

func main() {

    // Ми скористаємось панікою  на цьому місці для перевірки
    // на неочікувані помилки. Єдина мета цього шматка коду
    // запаніуквати.
    panic("маємо проблему")

    // Загальний використання паніки це перервати виконання функції
    // по повертає помилку яку ми не знаємо як (або не хочемо)
    // опрацьовувати. Ось приклад `panic`и якщо ми отримали
    // неочікувану помилку під час створення файлу.
    _, err := os.Create("/tmp/file")
    if err != nil {
        panic(err)
    }
}
